module r_expressions

include("diff_scheme.jl")
using .differentiations

#Module for computing spatial fluxes#
#Absorbing Boundary conditions#

# using CUDA

export donkey
function donkey((d2ϕ_1_dx2,d2ϕ_1_dy2,d2ϕ_1_dz2),
    (ϕ_1,ϕ_2,ϕ_3,ϕ_4,Γ_1,Γ_2,Γ_3,Σ),
    gw,gy,vev,lambda,
    (W_1_2,W_1_3,W_1_4,W_2_2,W_2_3,W_2_4,W_3_2,W_3_3,W_3_4,Y_2,Y_3,Y_4),
    (dϕ_4_dx,dϕ_4_dy,dϕ_4_dz,dϕ_3_dx,dϕ_3_dy,dϕ_3_dz,dϕ_2_dx,dϕ_2_dy,dϕ_2_dz),
    (Dx_ϕ_2,Dy_ϕ_2,Dz_ϕ_2,Dx_ϕ_3,Dy_ϕ_3,Dz_ϕ_3,Dx_ϕ_4,Dy_ϕ_4,Dz_ϕ_4))
    # @views flux = (d2ϕ_1_dx2+d2ϕ_1_dy2+d2ϕ_1_dz2-
    # 0.5*gw*(((-W_1_2[i,j,k]*dϕ_4_dx)-(W_1_2[i,j,k]*dϕ_4_dx))))
    flux = (d2ϕ_1_dx2+d2ϕ_1_dy2+d2ϕ_1_dz2-
    0.5*gw*(((-W_1_2*dϕ_4_dx)-(W_1_3*dϕ_4_dy)-(W_1_4*dϕ_4_dz))-
    ((-W_2_2*dϕ_3_dx)-(W_2_3*dϕ_3_dy)-(W_2_4*dϕ_3_dz))))
    return flux
    # return (d2ϕ_1_dx2+d2ϕ_1_dy2+d2ϕ_1_dz2-
    # 0.5*gw*(((-W_1_2*dϕ_4_dx)-(W_1_3*dϕ_4_dy)-(W_1_4*dϕ_4_dz))))#-
    # ((-W_2_2*dϕ_3_dx)-(W_2_3*dϕ_3_dy)-(W_2_4*dϕ_3_dz))#+
    # ((-W_3_2*dϕ_2_dx)-(W_3_3*dϕ_2_dy)-(W_3_4*dϕ_2_dz))-
    # 0.5*gy*(-Y_2*dϕ_2_dx-
    #         Y_3*dϕ_2_dy-
    #         Y_4*dϕ_2_dz)-
    # 0.5*gw*((-W_1_2*Dx_ϕ_4-
    #         W_1_3*Dy_ϕ_4-
    #         W_1_4*Dz_ϕ_4)-
    #         (-W_2_2*Dx_ϕ_3-
    #         W_2_3*Dy_ϕ_3-
    #         W_2_4*Dz_ϕ_3)+
    #         (-W_3_2*Dx_ϕ_2-
    #         W_3_3*Dy_ϕ_2-
    #         W_3_4*Dz_ϕ_2))-
    # 0.5*gy*(-Y_2*Dx_ϕ_2-
    #         Y_3*Dy_ϕ_2-
    #         Y_4*Dz_ϕ_2)-
    # 2.0*lambda*(ϕ_1^2+ϕ_2^2+ϕ_3^2+ϕ_4^2-vev^2)*ϕ_1+
    # 0.5*((gw*Γ_3+gy*Σ)*ϕ_2-
    #     gw*Γ_2*ϕ_3+gw*Γ_1*ϕ_4))
end

export R_ϕ_1

@views function R_ϕ_1((d2ϕ_1_dx2,d2ϕ_1_dy2,d2ϕ_1_dz2),
    (ϕ_1,ϕ_2,ϕ_3,ϕ_4,Γ_1,Γ_2,Γ_3,Σ),
    gw,gy,vev,lambda,
    (W_1_2,W_1_3,W_1_4,W_2_2,W_2_3,W_2_4,W_3_2,W_3_3,W_3_4,Y_2,Y_3,Y_4),
    (dϕ_4_dx,dϕ_4_dy,dϕ_4_dz,dϕ_3_dx,dϕ_3_dy,dϕ_3_dz,dϕ_2_dx,dϕ_2_dy,dϕ_2_dz),
    (Dx_ϕ_2,Dy_ϕ_2,Dz_ϕ_2,Dx_ϕ_3,Dy_ϕ_3,Dz_ϕ_3,Dx_ϕ_4,Dy_ϕ_4,Dz_ϕ_4),
    (i,j,k))
    # @views flux = dϕ_4_dx*(W_1_2[i,j,k])
    # return flux
    # return W_1_2[i,j,k]+dϕ_4_dx
    # @cuprintln(dϕ_4_dx)
    # @cuprintln(W_1_2[i,j,k]*dϕ_4_dx)
    # return -dϕ_4_dx
    # 0.5*gw*((-W_1_2*dϕ_4_dx)))#-
    return (d2ϕ_1_dx2+d2ϕ_1_dy2+d2ϕ_1_dz2-
    0.5*gw*(((-W_1_2[i,j,k]*dϕ_4_dx)-
            (W_1_3[i,j,k]*dϕ_4_dy)-
            (W_1_4[i,j,k]*dϕ_4_dz))-
            (-W_2_2[i,j,k]*dϕ_3_dx-
            W_2_3[i,j,k]*dϕ_3_dy-
            W_2_4[i,j,k]*dϕ_3_dz)+
            (-W_3_2[i,j,k]*dϕ_2_dx-
            W_3_3[i,j,k]*dϕ_2_dy-
            W_3_4[i,j,k]*dϕ_2_dz))-
    0.5*gy*(-Y_2[i,j,k]*dϕ_2_dx-
            Y_3[i,j,k]*dϕ_2_dy-
            Y_4[i,j,k]*dϕ_2_dz)-
    0.5*gw*((-W_1_2[i,j,k]*Dx_ϕ_4-
            W_1_3[i,j,k]*Dy_ϕ_4-
            W_1_4[i,j,k]*Dz_ϕ_4)-
            (-W_2_2[i,j,k]*Dx_ϕ_3-
            W_2_3[i,j,k]*Dy_ϕ_3-
            W_2_4[i,j,k]*Dz_ϕ_3)+
            (-W_3_2[i,j,k]*Dx_ϕ_2-
            W_3_3[i,j,k]*Dy_ϕ_2-
            W_3_4[i,j,k]*Dz_ϕ_2))-
    0.5*gy*(-Y_2[i,j,k]*Dx_ϕ_2-
            Y_3[i,j,k]*Dy_ϕ_2-
            Y_4[i,j,k]*Dz_ϕ_2)-
    2.0*lambda*(ϕ_1[i,j,k]^2+ϕ_2[i,j,k]^2+ϕ_3[i,j,k]^2+ϕ_4[i,j,k]^2-vev^2)*ϕ_1[i,j,k]+
    0.5*((gw*Γ_3[i,j,k]+gy*Σ[i,j,k])*ϕ_2[i,j,k]-
        gw*Γ_2[i,j,k]*ϕ_3[i,j,k]+gw*Γ_1[i,j,k]*ϕ_4[i,j,k]))
end

export R_ϕ_2
function R_ϕ_2(d2ϕ_2_dx2,d2ϕ_2_dy2,d2ϕ_2_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,Γ_1,Γ_2,Γ_3,Σ,gw,gy,vev,lambda,
    W_1_2,W_1_3,W_1_4,W_2_2,W_2_3,W_2_4,W_3_2,W_3_3,W_3_4,Y_2,Y_3,Y_4,
    dϕ_4_dx,dϕ_4_dy,dϕ_4_dz,dϕ_3_dx,dϕ_3_dy,dϕ_3_dz,dϕ_1_dx,dϕ_1_dy,dϕ_1_dz,
    Dx_ϕ_1,Dy_ϕ_1,Dz_ϕ_1,Dx_ϕ_3,Dy_ϕ_3,Dz_ϕ_3,Dx_ϕ_4,Dy_ϕ_4,Dz_ϕ_4)
    return (d2ϕ_2_dx2+d2ϕ_2_dy2+d2ϕ_2_dz2+
    0.5*gw*((-W_1_2*dϕ_3_dx-
            W_1_3*dϕ_3_dy-
            W_1_4*dϕ_3_dz)+
            (-W_2_2*dϕ_4_dx-
            W_2_3*dϕ_4_dy-
            W_2_4*dϕ_4_dz)+
            (-W_3_2*dϕ_1_dx-
            W_3_3*dϕ_1_dy-
            W_3_4*dϕ_1_dz))+
    0.5*gy*(-Y_2*dϕ_1_dx-
            Y_3*dϕ_1_dy-
            Y_4*dϕ_1_dz)+
    0.5*gw*((-W_1_2*Dx_ϕ_3-
            W_1_3*Dy_ϕ_3-
            W_1_4*Dz_ϕ_3)+
            (-W_2_2*Dx_ϕ_4-
            W_2_3*Dy_ϕ_4-
            W_2_4*Dz_ϕ_4)+
            (-W_3_2*Dx_ϕ_1-
            W_3_3*Dy_ϕ_1-
            W_3_4*Dz_ϕ_1))+
    0.5*gy*(-Y_2*Dx_ϕ_1-
            Y_3*Dy_ϕ_1-
            Y_4*Dz_ϕ_1)-
    2.0*lambda*(ϕ_1^2+ϕ_2^2+ϕ_3^2+ϕ_4^2-vev^2)*ϕ_2-
    0.5*((gw*Γ_3+gy*Σ)*ϕ_1+
        gw*Γ_1*ϕ_3+gw*Γ_2*ϕ_4))
end

export R_ϕ_3
function R_ϕ_3(d2ϕ_3_dx2,d2ϕ_3_dy2,d2ϕ_3_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,Γ_1,Γ_2,Γ_3,Σ,gw,gy,vev,lambda,
    W_1_2,W_1_3,W_1_4,W_2_2,W_2_3,W_2_4,W_3_2,W_3_3,W_3_4,Y_2,Y_3,Y_4,
    dϕ_4_dx,dϕ_4_dy,dϕ_4_dz,dϕ_2_dx,dϕ_2_dy,dϕ_2_dz,dϕ_1_dx,dϕ_1_dy,dϕ_1_dz,
    Dx_ϕ_1,Dy_ϕ_1,Dz_ϕ_1,Dx_ϕ_2,Dy_ϕ_2,Dz_ϕ_2,Dx_ϕ_4,Dy_ϕ_4,Dz_ϕ_4)
    return (d2ϕ_3_dx2+d2ϕ_3_dy2+d2ϕ_3_dz2-
    0.5*gw*((-W_1_2*dϕ_2_dx-
            W_1_3*dϕ_2_dy-
            W_1_4*dϕ_2_dz)+
            (-W_2_2*dϕ_1_dx-
            W_2_3*dϕ_1_dy-
            W_2_4*dϕ_1_dz)-
            (-W_3_2*dϕ_4_dx-
            W_3_3*dϕ_4_dy-
            W_3_4*dϕ_4_dz))-
    0.5*gy*(-Y_2*dϕ_4_dx-
            Y_3*dϕ_4_dy-
            Y_4*dϕ_4_dz)-
    0.5*gw*((-W_1_2*Dx_ϕ_2-
            W_1_3*Dy_ϕ_2-
            W_1_4*Dz_ϕ_2)+
            (-W_2_2*Dx_ϕ_1-
            W_2_3*Dy_ϕ_1-
            W_2_4*Dz_ϕ_1)-
            (-W_3_2*Dx_ϕ_4-
            W_3_3*Dy_ϕ_4-
            W_3_4*Dz_ϕ_4))-
    0.5*gy*(-Y_2*Dx_ϕ_4-
            Y_3*Dy_ϕ_4-
            Y_4*Dz_ϕ_4)-
    2.0*lambda*(ϕ_1^2+ϕ_2^2+ϕ_3^2+ϕ_4^2-vev^2)*ϕ_3+
            0.5*((-gw*Γ_3+gy*Σ)*ϕ_4+
            gw*Γ_2*ϕ_1+
            gw*Γ_1*ϕ_2))
end

export R_ϕ_4
function R_ϕ_4(d2ϕ_4_dx2,d2ϕ_4_dy2,d2ϕ_4_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,Γ_1,Γ_2,Γ_3,Σ,gw,gy,vev,lambda,
    W_1_2,W_1_3,W_1_4,W_2_2,W_2_3,W_2_4,W_3_2,W_3_3,W_3_4,Y_2,Y_3,Y_4,
    dϕ_2_dx,dϕ_2_dy,dϕ_2_dz,dϕ_3_dx,dϕ_3_dy,dϕ_3_dz,dϕ_1_dx,dϕ_1_dy,dϕ_1_dz,
    Dx_ϕ_1,Dy_ϕ_1,Dz_ϕ_1,Dx_ϕ_3,Dy_ϕ_3,Dz_ϕ_3,Dx_ϕ_2,Dy_ϕ_2,Dz_ϕ_2)
    return (d2ϕ_4_dx2+d2ϕ_4_dy2+d2ϕ_4_dz2+
    0.5*gw*((-W_1_2*dϕ_1_dx-
            W_1_3*dϕ_1_dy-
            W_1_4*dϕ_1_dz)-
            (-W_2_2*dϕ_2_dx-
            W_2_3*dϕ_2_dy-
            W_2_4*dϕ_2_dz)-
            (-W_3_2*dϕ_3_dx-
            W_3_3*dϕ_3_dy-
            W_3_4*dϕ_3_dz))+
    0.5*gy*(-Y_2*dϕ_3_dx
            -Y_3*dϕ_3_dy-
            Y_4*dϕ_3_dz)+
    0.5*gw*((-W_1_2*Dx_ϕ_1-
            W_1_3*Dy_ϕ_1-
            W_1_4*Dz_ϕ_1)-
            (-W_2_2*Dx_ϕ_2-
            W_2_3*Dy_ϕ_2-
            W_2_4*Dz_ϕ_2)-
            (-W_3_2*Dx_ϕ_3-
            W_3_3*Dy_ϕ_3-
            W_3_4*Dz_ϕ_3))+
    0.5*gy*(-Y_2*Dx_ϕ_3-
            Y_3*Dy_ϕ_3-
            Y_4*Dz_ϕ_3)-
    2.0*lambda*(ϕ_1^2+ϕ_2^2+ϕ_3^2+ϕ_4^2-vev^2)*ϕ_4-
    0.5*((-gw*Γ_3+gy*Σ)*ϕ_3+
        gw*Γ_1*ϕ_1-gw*Γ_2*ϕ_2))
end

export R_W_1_1
function R_W_1_1()
    return ()
end

export R_W_1_2
function R_W_1_2(d2W_1_2_dx2,d2W_1_2_dy2,d2W_1_2_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_2,Γ_3,
    Dx_ϕ_1,Dx_ϕ_2,Dx_ϕ_3,Dx_ϕ_4,
    W_3_2,W_2_2,W_3_3,W_2_3,W_3_4,W_2_4,W_2_1,W_3_1,
    W_3_23,W_2_23,W_3_24,W_2_24,W_3_12,W_2_12,
    dW_2_2_dx,dW_3_2_dx,dW_2_2_dy,dW_3_2_dy,dW_2_2_dz,dW_3_2_dz,dΓ_1_dx)
    return (d2W_1_2_dx2+d2W_1_2_dy2+d2W_1_2_dz2+
    gw*(-(dW_2_2_dx*W_3_2-
        dW_3_2_dx*W_2_2)-
        (dW_2_2_dy*W_3_3-
        dW_3_2_dy*W_2_3)-
        (dW_2_2_dz*W_3_4-
        dW_3_2_dz*W_2_4)-
        # (W_2_2*0. -
        # W_3_2*0. )-
        (W_2_3*W_3_23-
        W_3_3*W_2_23)-
        (W_2_4*W_3_24-
        W_3_4*W_2_24))+
    gw*(ϕ_1*Dx_ϕ_4-
        ϕ_2*Dx_ϕ_3+
        ϕ_3*Dx_ϕ_2-
        ϕ_4*Dx_ϕ_1)-
    dΓ_1_dx-gw*(W_2_2*Γ_3-W_3_2*Γ_2)-
    gw*(W_2_1*W_3_12-
    W_3_1*W_2_12))
end

export R_W_1_3
function R_W_1_3(d2W_1_3_dx2,d2W_1_3_dy2,d2W_1_3_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_2,Γ_3,
    Dy_ϕ_1,Dy_ϕ_2,Dy_ϕ_3,Dy_ϕ_4,
    W_3_2,W_2_2,W_3_3,W_2_3,W_3_4,W_2_4,W_2_1,W_3_1,
    W_3_23,W_2_23,W_3_34,W_2_34,W_3_13,W_2_13,
    dW_2_3_dx,dW_3_3_dx,dW_2_3_dy,dW_3_3_dy,dW_2_3_dz,dW_3_3_dz,dΓ_1_dy)
    return (d2W_1_3_dx2+d2W_1_3_dy2+d2W_1_3_dz2+
    gw*(-(dW_2_3_dx*W_3_2-
        dW_3_3_dx*W_2_2)-
        (dW_2_3_dy*W_3_3-
        dW_3_3_dy*W_2_3)-
        (dW_2_3_dz*W_3_4-
        dW_3_3_dz*W_2_4)-
        (W_2_2*(-W_3_23)-
        W_3_2*(-W_2_23))-
        # (W_2_3*0. -
        # W_3_3*0. )-
        (W_2_4*W_3_34-
        W_3_4*W_2_34))+
    gw*(ϕ_1*Dy_ϕ_4-
        ϕ_2*Dy_ϕ_3+
        ϕ_3*Dy_ϕ_2-
        ϕ_4*Dy_ϕ_1)-
    dΓ_1_dy-
    gw*(W_2_3*Γ_3-
        W_3_3*Γ_2)-
    gw*(W_2_1*W_3_13-
        W_3_1*W_2_13))
end

export R_W_1_4
function R_W_1_4(d2W_1_4_dx2,d2W_1_4_dy2,d2W_1_4_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_2,Γ_3,
    Dz_ϕ_1,Dz_ϕ_2,Dz_ϕ_3,Dz_ϕ_4,
    W_3_2,W_2_2,W_3_3,W_2_3,W_3_4,W_2_4,W_2_1,W_3_1,
    W_3_14,W_2_14,W_3_24,W_2_24,W_3_34,W_2_34,
    dW_2_4_dx,dW_3_4_dx,dW_2_4_dy,dW_3_4_dy,dW_2_4_dz,dW_3_4_dz,dΓ_1_dz)
    return (d2W_1_4_dx2+d2W_1_4_dy2+d2W_1_4_dz2+
    gw*(-(dW_2_4_dx*W_3_2-
        dW_3_4_dx*W_2_2)-
        (dW_2_4_dy*W_3_3-
        dW_3_4_dy*W_2_3)-
        (dW_2_4_dz*W_3_4-
        dW_3_4_dz*W_2_4)-
        (W_2_2*(-W_3_24)-
        W_3_2*(-W_2_24))-
        (W_2_3*(-W_3_34)-
        W_3_3*(-W_2_34)))+
    gw*(ϕ_1*Dz_ϕ_4-
        ϕ_2*Dz_ϕ_3+
        ϕ_3*Dz_ϕ_2-
        ϕ_4*Dz_ϕ_1)-
    dΓ_1_dz-
    gw*(W_2_4*Γ_3-
        W_3_4*Γ_2)-
    gw*(W_2_1*W_3_14-
        W_3_1*W_2_14))
end

export R_W_2_1
function R_W_2_1()
    return ()
end

export R_W_2_2
function R_W_2_2(d2W_2_2_dx2,d2W_2_2_dy2,d2W_2_2_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_1,Γ_3,
    Dx_ϕ_1,Dx_ϕ_2,Dx_ϕ_3,Dx_ϕ_4,
    W_3_2,W_1_2,W_3_3,W_1_3,W_3_4,W_1_4,W_1_1,W_3_1,
    W_1_23,W_3_23,W_1_24,W_3_24,W_1_12,W_3_12,
    dW_1_2_dx,dW_3_2_dx,dW_1_2_dy,dW_3_2_dy,dW_1_2_dz,dW_3_2_dz,dΓ_2_dx)
    return (d2W_2_2_dx2+d2W_2_2_dy2+d2W_2_2_dz2+
    gw*(-(dW_3_2_dx*W_1_2-
        dW_1_2_dx*W_3_2)-
        (dW_3_2_dy*W_1_3-
        dW_1_2_dy*W_3_3)-
        (dW_3_2_dz*W_1_4-
        dW_1_2_dz*W_3_4)-
        # (W_3_2*0. -
        # W_1_2*0. )-
        (W_3_3*W_1_23-
        W_1_3*W_3_23)-
        (W_3_4*W_1_24-
        W_1_4*W_3_24))+
    gw*(-ϕ_1*Dx_ϕ_3-
        ϕ_2*Dx_ϕ_4+
        ϕ_3*Dx_ϕ_1+
        ϕ_4*Dx_ϕ_2)-
    dΓ_2_dx-
    gw*(W_3_2*Γ_1-
        W_1_2*Γ_3)-
    gw*(W_3_1*W_1_12-
        W_1_1*W_3_12))
end

export R_W_2_3
function R_W_2_3(d2W_2_3_dx2,d2W_2_3_dy2,d2W_2_3_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_1,Γ_3,
    Dy_ϕ_1,Dy_ϕ_2,Dy_ϕ_3,Dy_ϕ_4,
    W_3_2,W_1_2,W_3_3,W_1_3,W_3_4,W_1_4,W_1_1,W_3_1,
    W_1_23,W_3_23,W_1_34,W_3_34,W_1_13,W_3_13,
    dW_1_3_dx,dW_3_3_dx,dW_1_3_dy,dW_3_3_dy,dW_1_3_dz,dW_3_3_dz,dΓ_2_dy)
    return (d2W_2_3_dx2+d2W_2_3_dy2+d2W_2_3_dz2+
    gw*(-(dW_3_3_dx*W_1_2-
        dW_1_3_dx*W_3_2)-
        (dW_3_3_dy*W_1_3-
        dW_1_3_dy*W_3_3)-
        (dW_3_3_dz*W_1_4-
        dW_1_3_dz*W_3_4)-
        (W_3_2*(-W_1_23)-
        W_1_2*(-W_3_23))-
        # (W_3_3*0. -
        # W_1_3*0. )-
        (W_3_4*(W_1_34)-
        W_1_4*W_3_34))+
    gw*(-ϕ_1*Dy_ϕ_3-
        ϕ_2*Dy_ϕ_4+
        ϕ_3*Dy_ϕ_1+
        ϕ_4*Dy_ϕ_2)-
    dΓ_2_dy-
    gw*(W_3_3*Γ_1-
        W_1_3*Γ_3)-
    gw*(W_3_1*W_1_13-
        W_1_1*W_3_13))
end

export R_W_2_4
function R_W_2_4(d2W_2_4_dx2,d2W_2_4_dy2,d2W_2_4_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_1,Γ_3,
    Dz_ϕ_1,Dz_ϕ_2,Dz_ϕ_3,Dz_ϕ_4,
    W_3_2,W_1_2,W_3_3,W_1_3,W_3_4,W_1_4,W_1_1,W_3_1,
    W_1_14,W_3_14,W_1_24,W_3_24,W_1_34,W_3_34,
    dW_1_4_dx,dW_3_4_dx,dW_1_4_dy,dW_3_4_dy,dW_1_4_dz,dW_3_4_dz,dΓ_2_dz)
    return (d2W_2_4_dx2+d2W_2_4_dy2+d2W_2_4_dz2+
    gw*(-(dW_3_4_dx*W_1_2-
        dW_1_4_dx*W_3_2)-
        (dW_3_4_dy*W_1_3-
        dW_1_4_dy*W_3_3)-
        (dW_3_4_dz*W_1_4-
        dW_1_4_dz*W_3_4)-
        (W_3_2*(-W_1_24)-
        W_1_2*(-W_3_24))-
        (W_3_3*(-W_1_34)-
        W_1_3*(-W_3_34)))+
    gw*(-ϕ_1*Dz_ϕ_3-
        ϕ_2*Dz_ϕ_4+
        ϕ_3*Dz_ϕ_1+
        ϕ_4*Dz_ϕ_2)-
    dΓ_2_dz-
    gw*(W_3_4*Γ_1-
        W_1_4*Γ_3)-
    gw*(W_3_1*W_1_14-
        W_1_1*W_3_14))
end

export R_W_3_1
function R_W_3_1()
    return ()
end

export R_W_3_2
function R_W_3_2(d2W_3_2_dx2,d2W_3_2_dy2,d2W_3_2_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_1,Γ_2,
    Dx_ϕ_1,Dx_ϕ_2,Dx_ϕ_3,Dx_ϕ_4,
    W_2_2,W_1_2,W_2_3,W_1_3,W_2_4,W_1_4,W_1_1,W_2_1,
    W_1_23,W_2_23,W_2_24,W_1_24,W_1_12,W_2_12,
    dW_1_2_dx,dW_2_2_dx,dW_1_2_dy,dW_2_2_dy,dW_1_2_dz,dW_2_2_dz,dΓ_3_dx)
    return (d2W_3_2_dx2+d2W_3_2_dy2+d2W_3_2_dz2+
    gw*(-(dW_1_2_dx*W_2_2-
        dW_2_2_dx*W_1_2)-
        (dW_1_2_dy*W_2_3-
        dW_2_2_dy*W_1_3)-
        (dW_1_2_dz*W_2_4-
        dW_2_2_dz*W_1_4)-
        # (W_1_2*0. -
        # W_2_2*0. )-
        (W_1_3*W_2_23-
        W_2_3*W_1_23)-
        (W_1_4*W_2_24-
        W_2_4*W_1_24))+
    gw*(ϕ_1*Dx_ϕ_2-
        ϕ_2*Dx_ϕ_1-
        ϕ_3*Dx_ϕ_4+
        ϕ_4*Dx_ϕ_3)-
    dΓ_3_dx-
    gw*(W_1_2*Γ_2-
    W_2_2*Γ_1)-
    gw*(W_1_1*W_2_12-
    W_2_1*W_1_12))
end

export R_W_3_3
function R_W_3_3(d2W_3_3_dx2,d2W_3_3_dy2,d2W_3_3_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_1,Γ_2,
    Dy_ϕ_1,Dy_ϕ_2,Dy_ϕ_3,Dy_ϕ_4,
    W_2_2,W_1_2,W_2_3,W_1_3,W_2_4,W_1_4,W_1_1,W_2_1,
    W_1_23,W_2_23,W_2_34,W_1_34,W_1_13,W_2_13,
    dW_1_3_dx,dW_2_3_dx,dW_1_3_dy,dW_2_3_dy,dW_1_3_dz,dW_2_3_dz,dΓ_3_dy)
    return (d2W_3_3_dx2+d2W_3_3_dy2+d2W_3_3_dz2+
    gw*(-(dW_1_3_dx*W_2_2-
        dW_2_3_dx*W_1_2)-
        (dW_1_3_dy*W_2_3-
        dW_2_3_dy*W_1_3)-
        (dW_1_3_dz*W_2_4-
        dW_2_3_dz*W_1_4)-
        (W_1_2*(-W_2_23)-
        W_2_2*(-W_1_23))-
        # (W_1_3*0. -
        # W_2_3*0. )-
        (W_1_4*W_2_34-
        W_2_4*(W_1_34)))+
    gw*(ϕ_1*Dy_ϕ_2-
        ϕ_2*Dy_ϕ_1-
        ϕ_3*Dy_ϕ_4+
        ϕ_4*Dy_ϕ_3)-
    dΓ_3_dy-
    gw*(W_1_3*Γ_2-
        W_2_3*Γ_1)-
    gw*(W_1_1*W_2_13-
    W_2_1*W_1_13))
end

export R_W_3_4
function R_W_3_4(d2W_3_4_dx2,d2W_3_4_dy2,d2W_3_4_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gw,
    Γ_1,Γ_2,
    Dz_ϕ_1,Dz_ϕ_2,Dz_ϕ_3,Dz_ϕ_4,
    W_2_2,W_1_2,W_2_3,W_1_3,W_2_4,W_1_4,W_1_1,W_2_1,
    W_1_24,W_2_24,W_2_34,W_1_34,W_1_14,W_2_14,
    dW_1_4_dx,dW_2_4_dx,dW_1_4_dy,dW_2_4_dy,dW_1_4_dz,dW_2_4_dz,dΓ_3_dz)
    return (d2W_3_4_dx2+d2W_3_4_dy2+d2W_3_4_dz2+
    gw*(-(dW_1_4_dx*W_2_2-
        dW_2_4_dx*W_1_2)-
        (dW_1_4_dy*W_2_3-
        dW_2_4_dy*W_1_3)-
        (dW_1_4_dz*W_2_4-
        dW_2_4_dz*W_1_4)-
        (W_1_2*(-W_2_24)-
        W_2_2*(-W_1_24))-
        (W_1_3*(-W_2_34)-
        W_2_3*(-W_1_34)))+
    gw*(ϕ_1*Dz_ϕ_2-
        ϕ_2*Dz_ϕ_1-
        ϕ_3*Dz_ϕ_4+
        ϕ_4*Dz_ϕ_3)-
    dΓ_3_dz-
    gw*(W_1_4*Γ_2-
        W_2_4*Γ_1)-
    gw*(W_1_1*W_2_14-
        W_2_1*W_1_14))
end

export R_Y_1
function R_Y_1()
    return
end

export R_Y_2
function R_Y_2(d2Y_2_dx2,d2Y_2_dy2,d2Y_2_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gy,
    Dx_ϕ_1,Dx_ϕ_2,Dx_ϕ_3,Dx_ϕ_4,
    dΣ_dx)
    return (d2Y_2_dx2+d2Y_2_dy2+d2Y_2_dz2+
    gy*(ϕ_1*Dx_ϕ_2-
        ϕ_2*Dx_ϕ_1+
        ϕ_3*Dx_ϕ_4-
        ϕ_4*Dx_ϕ_3)-
        dΣ_dx)
end

export R_Y_3
function R_Y_3(d2Y_3_dx2,d2Y_3_dy2,d2Y_3_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gy,
    Dy_ϕ_1,Dy_ϕ_2,Dy_ϕ_3,Dy_ϕ_4,
    dΣ_dy)
    return (d2Y_3_dx2+d2Y_3_dy2+d2Y_3_dz2+
    gy*(ϕ_1*Dy_ϕ_2-
        ϕ_2*Dy_ϕ_1+
        ϕ_3*Dy_ϕ_4-
        ϕ_4*Dy_ϕ_3)-
        dΣ_dy)
end

export R_Y_4
function R_Y_4(d2Y_4_dx2,d2Y_4_dy2,d2Y_4_dz2,
    ϕ_1,ϕ_2,ϕ_3,ϕ_4,gy,
    Dz_ϕ_1,Dz_ϕ_2,Dz_ϕ_3,Dz_ϕ_4,
    dΣ_dz)
    return (d2Y_4_dx2+d2Y_4_dy2+d2Y_4_dz2+
    gy*(ϕ_1*Dz_ϕ_2-
        ϕ_2*Dz_ϕ_1+
        ϕ_3*Dz_ϕ_4-
        ϕ_4*Dz_ϕ_3)-
        dΣ_dz)
end

end